Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/voting/facilities_for_voters_with_disabilities.html.txt.tmx
Source language: en
Languages: ga

source: The latest date for receipt of supplement applications by registration authorities is:
ga: Seo a leanas na dátaí deireanacha a ghlacfaidh na húdaráis chláir le hiarratas chun a bheith curtha ar an bhforlíonadh:

source: • 2 days after the date of dissolution of the Dáil in the case of a general election
ga: • 2 lá tar éis an dáta lánscor na Dála i gcás olltoghcháin

source: • 2 days after the date of the order appointing polling day in the case of a Dáil bye-election
ga: • 2 lá tar éis dáta an ordaithe ag ceapadh lá na vótála i gcás fothoghchán Dála

source: • 22 days (excluding Sundays and public holidays) before polling day for other elections or referenda
ga: • 22 lá (seachas Dé Domhnaigh agus laethanta saoire poiblí) roimh an lá vótaíochta le haghaidh toghchán nó reifreann eile

source: Application forms are available from your local authority
ga: Tá foirmeacha iarratais ar fáil ó d'údarás áitiúil
